STMicroelectronics/STM32CubeH5/Projects/NUCLEO-H553ZG/Applications/NetXDuo/Nx_UDP_Echo_Client/EWARM/startup_stm32h553xx.s
        PUBWEAK GPDMA2_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
GPDMA2_Channel6_IRQHandler
        B GPDMA2_Channel6_IRQHandler

        PUBWEAK GPDMA2_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
GPDMA2_Channel7_IRQHandler
        B GPDMA2_Channel7_IRQHandler

        PUBWEAK UART7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART7_IRQHandler
        B UART7_IRQHandler

        PUBWEAK UART8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART8_IRQHandler
        B UART8_IRQHandler

        PUBWEAK FPU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FPU_IRQHandler
        B FPU_IRQHandler

        PUBWEAK ICACHE_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ICACHE_IRQHandler
        B ICACHE_IRQHandler

        PUBWEAK DCACHE1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DCACHE1_IRQHandler
        B DCACHE1_IRQHandler

        PUBWEAK ETH_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH_IRQHandler
        B ETH_IRQHandler

        PUBWEAK ETH_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH_WKUP_IRQHandler
        B ETH_WKUP_IRQHandler

        PUBWEAK FDCAN2_IT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN2_IT0_IRQHandler
        B FDCAN2_IT0_IRQHandler

        PUBWEAK FDCAN2_IT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN2_IT1_IRQHandler
        B FDCAN2_IT1_IRQHandler

        PUBWEAK CORDIC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CORDIC_IRQHandler
        B CORDIC_IRQHandler

        PUBWEAK DTS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTS_IRQHandler
        B DTS_IRQHandler

        PUBWEAK RNG_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RNG_IRQHandler
        B RNG_IRQHandler

        PUBWEAK OTFDEC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OTFDEC1_IRQHandler
        B OTFDEC1_IRQHandler

        PUBWEAK AES_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
AES_IRQHandler
        B AES_IRQHandler

        PUBWEAK HASH_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HASH_IRQHandler
        B HASH_IRQHandler

        PUBWEAK PKA_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PKA_IRQHandler
        B PKA_IRQHandler

        PUBWEAK CEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CEC_IRQHandler
        B CEC_IRQHandler

        PUBWEAK TIM12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM12_IRQHandler
        B TIM12_IRQHandler

        PUBWEAK I3C1_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C1_EV_IRQHandler
        B I3C1_EV_IRQHandler

        PUBWEAK I3C1_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C1_ER_IRQHandler
        B I3C1_ER_IRQHandler

        PUBWEAK I3C2_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C2_EV_IRQHandler
        B I3C2_EV_IRQHandler

        PUBWEAK I3C2_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C2_ER_IRQHandler
        B I3C2_ER_IRQHandler

        PUBWEAK COMP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
COMP_IRQHandler
        B COMP_IRQHandler

        PUBWEAK PLAY1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PLAY1_IRQHandler
        B PLAY1_IRQHandler

        PUBWEAK PLAY1_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PLAY1_S_IRQHandler
        B PLAY1_S_IRQHandler

        PUBWEAK ADC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC3_IRQHandler
        B ADC3_IRQHandler

        END
